app/controllers/students_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def edit
        @student = Student.find_by(id: params[:id])

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "Zivkovic"], ["updated_at", "2021-04-23 04:11:17.752111"], ["id", 3]]
---
    def update
        @student = Student.find_by(id: params[:id])
        @student.update(params.require(:student).permit(:first_name, :last_name))